20210816185339-presidentielles_2022.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-21 Wed 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Presidentielles 2022</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Presidentielles 2022</h1>

<div id="outline-container-org4f07732" class="outline-2">
<h2 id="org4f07732"><span class="todo TODO">TODO</span> Second tour</h2>
<div class="outline-text-2" id="text-org4f07732">
</div>
<div id="outline-container-org89c6e47" class="outline-3">
<h3 id="org89c6e47"><span class="todo TODO">TODO</span> Template HTML pour sondages election second tour</h3>
<div class="outline-text-3" id="text-org89c6e47">
<ul class="org-ul">
<li>Si la date de sortie du sondage est la même qu'aujourd'hui -&gt; "Aujourd'hui" sinon date</li>
<li>Ecart avec 2e candidat</li>
<li>Résultat en % des inscrits</li>
<li>Carré avec couleur du candidat. Transparence donne l'échelle du score</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">date sondage</td>
<td class="org-left">Institut (lien vers l'étude)</td>
<td class="org-left">Taille de l'échantillon</td>
<td class="org-left">Scenarii</td>
<td class="org-left">Resultat net</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org51b8eac" class="outline-3">
<h3 id="org51b8eac"><span class="todo TODO">TODO</span> Faire tourner sur 3-4 sondages</h3>
</div>
<div id="outline-container-org9f7c58c" class="outline-3">
<h3 id="org9f7c58c"><span class="todo TODO">TODO</span> Graphe scenario le plus probable (sans incertitudes)</h3>
</div>
</div>

<div id="outline-container-org9075515" class="outline-2">
<h2 id="org9075515"><span class="todo TODO">TODO</span> Premier tour</h2>
<div class="outline-text-2" id="text-org9075515">
</div>
<div id="outline-container-org9d1b399" class="outline-3">
<h3 id="org9d1b399"><span class="todo TODO">TODO</span> Template HTML pour sondages election premier tour</h3>
<div class="outline-text-3" id="text-org9d1b399">
<ul class="org-ul">
<li>Si la date de sortie du sondage est la même qu'aujourd'hui -&gt; "Aujourd'hui" sinon date</li>
<li>Ecart avec 3e candidat pour les deux premiers candidats</li>
<li>Résultat en % des inscrits</li>
<li>Carré avec couleur du candidat. Transparence donne l'échelle du score</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">date sondage</td>
<td class="org-left">Institut (lien vers l'étude)</td>
<td class="org-left">Taille de l'échantillon</td>
<td class="org-left">Scenarii</td>
<td class="org-left">Resultat net</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-orgecd480e" class="outline-2">
<h2 id="orgecd480e">Sondages</h2>
<div class="outline-text-2" id="text-orgecd480e">
<p>
On peut récupérer les sondages sur la <a target='_blank' rel='noopener noreferrer' class='external' href="https://fr.wikipedia.org/wiki/Liste_de_sondages_sur_l%27%C3%A9lection_pr%C3%A9sidentielle_fran%C3%A7aise_de_2022">page wikipédia</a> dédiée, qui parait plutôt à jour.
</p>
</div>

<div id="outline-container-orge9d2833" class="outline-3">
<h3 id="orge9d2833">Format de données</h3>
<div class="outline-text-3" id="text-orge9d2833">
</div>
<div id="outline-container-orga6e4845" class="outline-4">
<h4 id="orga6e4845">Second tour</h4>
<div class="outline-text-4" id="text-orga6e4845">
<p>
Il semble que la proportion d'indécis est importante; il est donc nécessaire de la prendre en compte. Mais il faut faire la distinction entre ce qui est de l'ordre du vote blanc/nul, du refus de se prononcer lors de l'étude
</p>

<p>
La difficulté est que les différents instituts de sondage ne présentent pas la même information. En effet, l'ensemble des inscrits peut être séparé entre:
</p>
<ol class="org-ol">
<li>Abstention</li>
<li>Vote blanc ou nul</li>
<li>Suffrage exprimé</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="orga7a874c"></a>Harris<br />
<div class="outline-text-5" id="text-orga7a874c">
<p>
Les deux questions suivantes sont systématiquement posées:
</p>
<ul class="org-ul">
<li>"Et si le second tour de l’élection présidentielle avait lieu dimanche prochain, parmi les candidats suivants, pour lequel y aurait-il le plus de chances que vous votiez ?"</li>
<li>"Et diriez-vous que vous êtes tout à fait sûr(e) de votre choix ou que vous pourriez encore changer d’avis ?"</li>
</ul>

<p>
Dans la première notice il y a mention de l'abstention, blanc/nul mais plus ensuite.
</p>
</div>
</li>

<li><a id="org1c96bda"></a>Elabe<br />
<div class="outline-text-5" id="text-org1c96bda">
<p>
"Et au second tour de l’élection présidentielle en 2022, si vous aviez le choix entre les candidats suivants, pour qui voteriez-vous ?"
    • Emmanuel MACRON
    • Marine LE PEN
    • Vous voteriez blanc
    • Vous n'iriez pas voter
</p>
</div>
</li>

<li><a id="org14cd5f6"></a>Ifop<br />
<div class="outline-text-5" id="text-org14cd5f6">
<ul class="org-ul">
<li>"Si dimanche prochain devait se dérouler le second tour de l’élection</li>
</ul>
<p>
présidentielle, pour lequel des candidats suivants y aurait-il le plus de chance que vous votiez?"
</p>

<p>
Donne le pourcentage "ne se prononcent pas" -&gt; pas de vote blanc/nul? Ce n'est vraiment pas clair.
</p>
</div>
</li>

<li><a id="orgd76e343"></a>Ipsos<br />
<div class="outline-text-5" id="text-orgd76e343">
<p>
"Si le 2nd tour de l’élection présidentielle avait lieu dimanche prochain et si vous aviez le choix entre les candidats
suivants, quel est celui pour lequel il y aurait le plus de chances que vous votiez au 2nd tour?"
</p>

<p>
"Personnes certaines d’aller voter n’ayant pas exprimé d’intention de vote : X %"
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd533ed7" class="outline-3">
<h3 id="orgd533ed7"><span class="todo TODO">TODO</span> Entrer les sondages 2nd tour à la main dans un fichier yaml</h3>
</div>
<div id="outline-container-orga82d3c5" class="outline-3">
<h3 id="orga82d3c5"><span class="todo TODO">TODO</span> Valider le yaml dans la CI</h3>
</div>
<div id="outline-container-org167375c" class="outline-3">
<h3 id="org167375c"><span class="todo TODO">TODO</span> Plot 2nd tour polls using altair</h3>
</div>
</div>

<div id="outline-container-org8c37936" class="outline-2">
<h2 id="org8c37936">Site web</h2>
<div class="outline-text-2" id="text-org8c37936">
<p>
Il faut une page avec les <a target='_blank' rel='noopener noreferrer' class='external' href="https://projects.fivethirtyeight.com/polls/president-general/national/">derniers sondages</a> pour le premier et deuxième tour.
</p>
</div>
</div>

<div id="outline-container-org243a018" class="outline-2">
<h2 id="org243a018">Links to this note</h2>
</div>
</div>
</body>
</html>